In [2]:
import mysql.connector as m

db=m.connect(host="localhost",user='root',passwd='root')
cur=db.cursor()
cur.execute("create database if not exists question1")
cur.execute("use question1")
#cur.execute("create table if not exists Shoes (code int primary key,name varchar(20),type varchar(10),size int,cost float,margin float,qty int)")
#cur.execute("insert into shoes values(1001,'School Canvas','School',6,132.50,2.00,1200)");
#cur.execute("insert into shoes values(1002,'School Canvas','School',7,135.50,2.00,800)");
#cur.execute("insert into shoes values(1003,'School Canvas','School',8,140.75,2.00,600)");
#cur.execute("insert into shoes values(1004,'School Leather','School',6,232.50,2.00,2200)");
#cur.execute("insert into shoes values(1005,'School Leather','School',7,270.00,2.00,1280)");
'''cur.execute("select * from shoes")
for i in cur:
    print(i)
            
db.commit()'''

cur.execute("use question1")
cur.execute("create table if not exists Students(ID int primary key,name varchar(20), Cls int(5),grade char(2),total_marks int)")
'''cur.execute("insert into Students values(101,'Maitri Gosalia',12,'A',93)");
cur.execute("insert into Students values(102,'Meet Gosalia',12,'B',85)");
cur.execute("insert into Students values(103,'Kishan Suchak',12,'B',83)");
cur.execute("insert into Students values(104,'Krishna Thakkar',12,'A',91)");
cur.execute("insert into Students value(105,'Heli Shah',12,'B',81)");
db.commit()'''
cur.execute("select * from Students where ID = 102 ")
for i in cur:
    print(i)

(102, 'Meet Gosalia', 12, 'B', 85)

In [51]:
import mysql.connector as m
db=m.connect(host='localhost',user='root',passwd='root')
cur=db.cursor()
#cur.execute("create database if not exists medicine1")
print("Database sucessfully created")
cur.execute("use medicine1")
#cur.execute("create table if not exists drug1(Drug_ID int primary key,Name1 varchar(30),Price1 int,PharmaName1 varchar(50),Location1 varchar(20))")
print("Table created")
#cur.execute("insert into drug1 values(1005,'Dolo 650',80,'Emcure Pharma','Pune')")
#cur.execute("insert into drug1 values(1852,'Livozin',50,'Biocon Ltd','Bengaluru')")
#cur.execute("insert into drug1 values(1553,'Paracitamol',75,'Torrent Pharma','Ahmedabad')")
#cur.execute("insert into drug1 values(1653,'Keppra',55,'Emcure Pharma','Pune')")
#cur.execute("insert into drug1 values(1542,'K-tab',70,'Biocon ltd','Bengaluru')")
#cur.execute("insert into drug1 values(1234,'Medrol',155,'Torrent Pharma','Ahmedabad')")
#cur.execute("insert into drug1 values(1754,'Mavyret',65,'Sun Pharma','Goregon')")
#cur.execute("insert into drug1 values(1752,'Actos',85,'Cipla','Ahmedabad')")
#cur.execute("insert into drug1 values(1896,'Abilify',128,'Sun Pharma','Goregon')")
#cur.execute("insert into drug1 values(1774,'Avjovy',155,'Cadila Pharma','Pune')")

#cur.execute("select * from drug1 where location1='Pune'")
#cur.execute("select * from drug1 where Price1>=100")
#cur.execute("select * from drug1 where Drug_ID=1234")
#cur.execute("alter table drug1 add Qut int")
#cur.execute("delete from drug1 where Drug_ID=1234")
#cur.execute("update drug1 set Qut=100")
db.commit()
cur.execute("select * from drug1")
for i in cur:
    print(i)
print("successful")

Database sucessfully created
Table created
(1234, 'Medrol', 155, 'Torrent Pharma', 'Ahmedabad', 100)
(1542, 'K-tab', 70, 'Biocon ltd', 'Bengaluru', 100)
(1553, 'Paracitamol', 75, 'Torrent Pharma', 'Ahmedabad', 100)
(1653, 'Keppra', 55, 'Emcure Pharma', 'Pune', 100)
(1745, 'Dolo 650', 80, 'Emcure Pharma', 'Pune', 100)
(1752, 'Actos', 85, 'Cipla', 'Ahmedabad', 100)
(1754, 'Mavyret', 65, 'Sun Pharma', 'Goregon', 100)
(1774, 'Avjovy', 155, 'Cadila Pharma', 'Pune', 100)
(1852, 'Livozin', 50, 'Biocon Ltd', 'Bengaluru', 100)
(1896, 'Abilify', 128, 'Sun Pharma', 'Goregon', 100)
successful

In [4]:
import mysql.connector as m
db=m.connect(host='localhost',user='root',passwd='root')
cur=db.cursor()

cur.execute("use Client")
#cur.execute("drop table Client_master")
#cur.execute("create table Client_master(c_no varchar(5),Name varchar(20),City varchar(15),Pincode int,State varchar(15),Bal_due int)")

# cur.execute("insert into Client_master values('C001','Ivan','Bombay',400054,'Maharastra',15000)")
# cur.execute("insert into Client_master values('C002','Vandana','Madras',780001,'Tamil Nadu',0)")
# cur.execute("insert into Client_master values('C003','Pramada','Bombay',400057,'Maharastra',5000)")
# cur.execute("insert into Client_master values('C004','Basu','Bombay',400056,'Maharastra',0)")
# cur.execute("insert into Client_master values('C005','Ravi','Delhi',100001,Null,2000)")
# cur.execute("insert into Client_master values('C006','Rukmani','Bombay',400050,'Maharastra',0)")
db.commit()

#cur.execute("select * from Client_master")
#cur.execute("select distinct Name from Client_master")
#cur.execute("select * from Client_master where City='Bombay' ")
#cur.execute("select Name from Client_master")
#cur.execute("select Name,City from Client_master")
#cur.execute("update Client_master set City='Bombay' where c_no='C002'")
#cur.execute("update Client_master set Bal_due=1000 where c_no='C001'")
#cur.execute("delete from Client_master where State='Tamil Nadu'")
#cur.execute("alter table Client_master add Telephone int(10)")
cur.execute("select * from Client_master")
for i in cur:
    print(i)

('C001', 'Ivan', 'Bombay', 400054, 'Maharastra', 1000, None)
('C003', 'Pramada', 'Bombay', 400057, 'Maharastra', 5000, None)
('C004', 'Basu', 'Bombay', 400056, 'Maharastra', 0, None)
('C005', 'Ravi', 'Delhi', 100001, None, 2000, None)
('C006', 'Rukmani', 'Bombay', 400050, 'Maharastra', 0, None)

In [35]:
import mysql.connector as m
db=m.connect(host='localhost',user='root',passwd='root')
cur=db.cursor()
cur.execute("create database if not exists Class1")
cur.execute("use Class1")
# cur.execute("drop table Marks1")
cur.execute("create table if not exists Marks1(Roll_no int primary key,Name varchar(20),Class char(1),Marks int)")
# print("succesfully table created")
# cur.execute("insert into Marks1 values(01,'Maitri Gosalia','A',85)")
# cur.execute("insert into Marks1 values(02,'Kishan Suchak','B',88)")
# cur.execute("insert into Marks1 values(03,'Meet Gosalia','A',80)")
# cur.execute("insert into Marks1 values(04,'Heli Shah','F',78)")
# cur.execute("insert into Marks1 values(05,'Krishna Thakkar','B',35)")
# cur.execute("insert into Marks1 values(06,'Rutvi Patel','A',49)")


#cur.execute("select * from Marks1 where Marks>=50")
# cur.execute("update Marks1 set Marks=90 where Class='A'")
#cur.execute("alter table Marks1 add Grade int")
#cur.execute("delete from Marks1 where Name='Heli Shah'")
#cur.execute("update Marks1 set Grade=11 where Marks>=85 and Class='A'")
#cur.execute("update Marks1 set Grade=22 where Marks<=85 and Class='B'")
#cur.execute("update Marks1 set Grade=12 where Marks<=85 and Class='A'")
#cur.execute("update Marks1 set Grade=21 where Marks>=85 and Class='B'")
#cur.execute("update Marks1 set Grade=50 where Class='F' and Roll_no=04")
#cur.execute("alter table Marks1 drop column Grade")
db.commit()
cur.execute("select * from Marks1")

for i in cur:
    print(i)

(1, 'Maitri Gosalia', 'A', 85)
(2, 'Kishan Suchak', 'B', 88)
(3, 'Meet Gosalia', 'A', 80)
(4, 'Heli Shah', 'F', 78)
(5, 'Krishna Thakkar', 'B', 35)
(6, 'Rutvi Patel', 'A', 49)

In [16]:
import mysql.connector as m
db=m.connect(host='localhost',user='root',passwd='root')
cur=db.cursor()
cur.execute("create database if not exists Em")
cur.execute("use Em")
#cur.execute("drop table Employee")
print("Database created")
cur.execute("create table if not exists Employee(Em_ID int primary key,E_name varchar(50),E_position varchar(60))")
print("Successfully table created")
# cur.execute("insert into Employee values(01,'Maitri Mihir Gosalia','Business Analyst')")
# cur.execute("insert into Employee values(02,'Meet Mihir Gosalia','Software Engineer')")
# cur.execute("insert into Employee values(03,'Kishan B. Suchak','Social Media Managar')")
# cur.execute("insert into Employee values(04,'Krishna B. Thakkar','Digital Marketing Head')")
# cur.execute("insert into Employee values(05,'Heli Shah','Supply Chain and Logistics Head')")
db.commit()

#cur.execute("select * from Employee where Em_ID>=03")
#cur.execute("select E_name,E_position from Employee where Em_ID>=03 or E_position='Business Analyst'")
#cur.execute("alter table Employee add Salary int")
#cur.execute("update Employee set Salary=10000")
#cur.execute("update Employee set Salary=70000 where E_position='Business Analyast'")
#cur.execute("delete from Employee where Em_ID=05")
#cur.execute("alter table Employee drop column Salary")
cur.execute("select * from Employee")
for i in cur:
    print(i)

Database created
Successfully table created
(1, 'Maitri Mihir Gosalia', 'Business Analyast')
(2, 'Meet Mihir Gosalia', 'Software Engineer')
(3, 'Kishan B. Suchak', 'Social Media Managar')
(4, 'Krishna B. Thakkar', 'Digital Marketing Head')
(5, 'Heli Shah', 'Supply Chain and Logistics Head')

In [4]:
import mysql.connector as m
db=m.connect(host='localhost',user='root',passwd='root')
cur=db.cursor()
cur.execute("create database if not exists Salesman")
cur.execute("use Salesman")
#cur.execute("drop table Salesman_master")
print("Database created")
cur.execute("create table if not exists Salesman_master(S_no varchar(6) primary key,S_name varchar(30),Address1 varchar(30),Address2 varchar(30),City varchar(20),Pincode int,State varchar(20),Sal_amt int)")
print("Table created")
# cur.execute("insert into Salesman_master values('AB0001','Maitri Gosalia','78-Binori','Prahladnagar','Ahmedabad',380058,'Gujrat',8000)")
# cur.execute("insert into Salesman_master values('CD0002','Meet Gosalia','A-51 Spring Valley','Bodakdev','Rajkot',785214,'Gujrat',3500)")
# cur.execute("insert into Salesman_master values('EF0003','Kishan Suchak','B-803 Garden city','Alkapuri','Baroda',785410,'Gujrat',7500)")
# cur.execute("insert into Salesman_master values('GH0004','Krishna Thakkar','B88 Bhumi Hills','TPS school road','Ghatkopar',551412,'Maharastra',8600)")
# cur.execute("insert into Salesman_master values('IJ0005','Heli Shah','F-45 Swagat city','Green City','Kandivali',722406,'Maharastra',5200)")
db.commit()

#cur.execute("delete from Salesman_master where Sal_amt=3500")
#cur.execute("alter table Salesman_master add Telephone int")
#cur.execute("update Salesman_master set City='Mumbai'")
#cur.execute("select S_name from Salesman_master where Sal_amt>=3000")
#cur.execute("select * from Salesman_master")
for i in cur:
    print(i)

Database created
Table created
('Maitri Gosalia',)
('Meet Gosalia',)
('Kishan Suchak',)
('Krishna Thakkar',)
('Heli Shah',)